; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain delivery)
    (:types
        room item arm bot - object
    )
    (:predicates
        (at-bot ?b - bot ?x - room)
        (at ?i - item ?x - room)
        (door ?x - room ?y - room)
        (free ?a - arm)
        (in-arm ?i - item ?a - arm)
        (in-tray ?i - item ?b - bot)
        (mount ?a - arm ?b - bot)
    )

    (:functions
        (load_limit ?b - bot)
        (current_load ?b - bot)
        (weight ?i - item)
        (cost)
    )

    (:action move
        :parameters (?b - bot ?x - room ?y - room)
        :precondition (and (at-bot ?b ?x)
            (door ?x ?y))
        :effect (and (at-bot ?b ?y)
            (not (at-bot ?b ?x))
            (increase (cost) 3)
        )
    )

    (:action pick
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (at ?i ?x) (at-bot ?b ?x) (free ?a) (mount ?a ?b)
            (<= (+ (current_load ?b) (weight ?i)) (load_limit ?b)))
        :effect (and (in-arm ?i ?a)
            (not (at ?i ?x))
            (not (free ?a))
            (increase (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action drop
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (at-bot ?b ?x)
            (mount ?a ?b))
        :effect (and (free ?a)
            (at ?i ?x)
            (not (in-arm ?i ?a))
            (decrease (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action to-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (mount ?a ?b))
        :effect (and (free ?a)
            (not (in-arm ?i ?a))
            (in-tray ?i ?b)
            (increase (cost) 1)
        )
    )

    (:action from-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-tray ?i ?b)
            (mount ?a ?b)
            (free ?a))
        :effect (and (not (free ?a))
            (in-arm ?i ?a)
            (not (in-tray ?i ?b))
            (increase (cost) 1)
        )
    )
)

; problem
(define (problem delivery-x-4)
   (:domain delivery)
   (:objects rooma roomb roomc roomd - room
             item12 item11 item10
             item9 item8 item7 item6 item5 item4 item3 item2 item1 - item
             bot1 bot2 - bot
             left1 right1 left2 right2 - arm)
   (:init (= (weight item10) 2)
          (= (weight item9) 2)
          (= (weight item8) 1)
          (= (weight item7) 1)
          (= (weight item6) 1)
          (= (weight item5) 1)
          (= (weight item4) 1)
          (= (weight item3) 1)
          (= (weight item2) 1)
          (= (weight item1) 1)
          (at item10 rooma)
          (at item9 rooma)
          (at item8 rooma)
          (at item7 rooma)
          (at item6 rooma)
          (at item5 rooma)
          (at item4 rooma)
          (at item3 rooma)
          (at item2 rooma)
          (at item1 rooma)

          (at-bot bot1 rooma)
          (at-bot bot2 rooma)
          (free left1)
          (free right1)
          (free left2)
          (free right2)
          (mount left1 bot1)
          (mount right1 bot1)
          (mount left2 bot2)
          (mount right2 bot2)

          (door rooma roomb)
          (door roomb rooma)
          (door roomd roomb)
          (door roomb roomd)
          (door rooma roomc)
          (door roomc rooma)

          (= (current_load bot1) 0)
          (= (load_limit bot1) 4)
          (= (current_load bot2) 0)
          (= (load_limit bot2) 4)
          (= (cost) 0))

   (:goal (and (at item10 roomb)
               (at item9 roomb)
               (at item8 roomd)
               (at item7 roomd)
               (at item6 roomd)
               (at item5 roomd)
               (at item4 roomc)
               (at item3 roomc)
               (at item2 roomc)
               (at item1 roomc)))

               (:metric minimize (cost))

)

; plan
1. (pick item5 rooma left2 bot2)
   deleted: (at item5 rooma) (free left2)
   added: (in-arm item5 left2)
   changed: (current_load bot2) from 0 to 1, (cost) from 0 to 2
   goals met: 0 of 10
2. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 2 to 5
   goals met: 0 of 10
3. (move bot2 roomb roomd)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 roomd)
   changed: (cost) from 5 to 8
   goals met: 0 of 10
4. (pick item6 rooma left1 bot1)
   deleted: (at item6 rooma) (free left1)
   added: (in-arm item6 left1)
   changed: (current_load bot1) from 0 to 1, (cost) from 8 to 10
   goals met: 0 of 10
5. (drop item5 roomd left2 bot2)
   deleted: (in-arm item5 left2)
   added: (free left2) (at item5 roomd)
   changed: (current_load bot2) from 1 to 0, (cost) from 10 to 12
   goals met: 1 of 10
6. (move bot2 roomd roomb)
   deleted: (at-bot bot2 roomd)
   added: (at-bot bot2 roomb)
   changed: (cost) from 12 to 15
   goals met: 1 of 10
7. (move bot2 roomb rooma)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 rooma)
   changed: (cost) from 15 to 18
   goals met: 1 of 10
8. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 18 to 21
   goals met: 1 of 10
9. (move bot1 roomb roomd)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 roomd)
   changed: (cost) from 21 to 24
   goals met: 1 of 10
10. (pick item4 rooma left2 bot2)
   deleted: (at item4 rooma) (free left2)
   added: (in-arm item4 left2)
   changed: (current_load bot2) from 0 to 1, (cost) from 24 to 26
   goals met: 1 of 10
11. (drop item6 roomd left1 bot1)
   deleted: (in-arm item6 left1)
   added: (free left1) (at item6 roomd)
   changed: (current_load bot1) from 1 to 0, (cost) from 26 to 28
   goals met: 2 of 10
12. (move bot1 roomd roomb)
   deleted: (at-bot bot1 roomd)
   added: (at-bot bot1 roomb)
   changed: (cost) from 28 to 31
   goals met: 2 of 10
13. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 31 to 34
   goals met: 2 of 10
14. (drop item4 roomc left2 bot2)
   deleted: (in-arm item4 left2)
   added: (free left2) (at item4 roomc)
   changed: (current_load bot2) from 1 to 0, (cost) from 34 to 36
   goals met: 3 of 10
15. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 36 to 39
   goals met: 3 of 10
16. (pick item3 rooma left2 bot2)
   deleted: (at item3 rooma) (free left2)
   added: (in-arm item3 left2)
   changed: (current_load bot2) from 0 to 1, (cost) from 39 to 41
   goals met: 3 of 10
17. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 41 to 44
   goals met: 3 of 10
18. (drop item3 roomc left2 bot2)
   deleted: (in-arm item3 left2)
   added: (free left2) (at item3 roomc)
   changed: (current_load bot2) from 1 to 0, (cost) from 44 to 46
   goals met: 4 of 10
19. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 46 to 49
   goals met: 4 of 10
20. (pick item7 rooma right2 bot2)
   deleted: (at item7 rooma) (free right2)
   added: (in-arm item7 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 49 to 51
   goals met: 4 of 10
21. (pick item2 rooma left2 bot2)
   deleted: (at item2 rooma) (free left2)
   added: (in-arm item2 left2)
   changed: (current_load bot2) from 1 to 2, (cost) from 51 to 53
   goals met: 4 of 10
22. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 53 to 56
   goals met: 4 of 10
23. (pick item8 rooma right1 bot1)
   deleted: (at item8 rooma) (free right1)
   added: (in-arm item8 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 56 to 58
   goals met: 4 of 10
24. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 58 to 61
   goals met: 4 of 10
25. (move bot1 roomb roomd)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 roomd)
   changed: (cost) from 61 to 64
   goals met: 4 of 10
26. (to-tray item2 left2 bot2)
   deleted: (in-arm item2 left2)
   added: (free left2) (in-tray item2 bot2)
   changed: (cost) from 64 to 65
   goals met: 4 of 10
27. (drop item8 roomd right1 bot1)
   deleted: (in-arm item8 right1)
   added: (free right1) (at item8 roomd)
   changed: (current_load bot1) from 1 to 0, (cost) from 65 to 67
   goals met: 5 of 10
28. (move bot1 roomd roomb)
   deleted: (at-bot bot1 roomd)
   added: (at-bot bot1 roomb)
   changed: (cost) from 67 to 70
   goals met: 5 of 10
29. (pick item1 rooma left2 bot2)
   deleted: (at item1 rooma) (free left2)
   added: (in-arm item1 left2)
   changed: (current_load bot2) from 2 to 3, (cost) from 70 to 72
   goals met: 5 of 10
30. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 72 to 75
   goals met: 5 of 10
31. (drop item1 roomc left2 bot2)
   deleted: (in-arm item1 left2)
   added: (free left2) (at item1 roomc)
   changed: (current_load bot2) from 3 to 2, (cost) from 75 to 77
   goals met: 6 of 10
32. (from-tray item2 left2 bot2)
   deleted: (free left2) (in-tray item2 bot2)
   added: (in-arm item2 left2)
   changed: (cost) from 77 to 78
   goals met: 6 of 10
33. (drop item2 roomc left2 bot2)
   deleted: (in-arm item2 left2)
   added: (free left2) (at item2 roomc)
   changed: (current_load bot2) from 2 to 1, (cost) from 78 to 80
   goals met: 7 of 10
34. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 80 to 83
   goals met: 7 of 10
35. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 83 to 86
   goals met: 7 of 10
36. (move bot2 roomb roomd)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 roomd)
   changed: (cost) from 86 to 89
   goals met: 7 of 10
37. (drop item7 roomd right2 bot2)
   deleted: (in-arm item7 right2)
   added: (free right2) (at item7 roomd)
   changed: (current_load bot2) from 1 to 0, (cost) from 89 to 91
   goals met: 8 of 10
38. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 91 to 94
   goals met: 8 of 10
39. (pick item9 rooma right1 bot1)
   deleted: (at item9 rooma) (free right1)
   added: (in-arm item9 right1)
   changed: (current_load bot1) from 0 to 2, (cost) from 94 to 96
   goals met: 8 of 10
40. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 96 to 99
   goals met: 8 of 10
41. (drop item9 roomb right1 bot1)
   deleted: (in-arm item9 right1)
   added: (free right1) (at item9 roomb)
   changed: (current_load bot1) from 2 to 0, (cost) from 99 to 101
   goals met: 9 of 10
42. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 101 to 104
   goals met: 9 of 10
43. (pick item10 rooma right1 bot1)
   deleted: (at item10 rooma) (free right1)
   added: (in-arm item10 right1)
   changed: (current_load bot1) from 0 to 2, (cost) from 104 to 106
   goals met: 9 of 10
44. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 106 to 109
   goals met: 9 of 10
45. (drop item10 roomb right1 bot1)
   deleted: (in-arm item10 right1)
   added: (free right1) (at item10 roomb)
   changed: (current_load bot1) from 2 to 0, (cost) from 109 to 111
   goals met: 10 of 10
